#read design
read_verilog fifo.v memory.v read_logic.v write_logic.v control_logic.v
hierarchy -check -top fifo

#the high-level stuff
proc; opt; fsm; opt; memory; opt

#mapping to internal cell library
techmap; opt

#mapping flip-flop to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

#mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

#write synthesized design
write_verilog fifo_synth.v