#read design
read_verilog memory.v
hierarchy -check -top memory

#the high-level stuff
proc; opt; fsm; opt; memory; opt

#mapping to internal cell library
techmap; opt

#mapping flip-flop to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

#mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

#write synthesized design
write_verilog memory_synth.v